IdeaRS.OpenModel.Geometry2D.Region2D
Represents a region in two-dimensional space included outline (border) and openings.

IdeaRS.OpenModel.Geometry2D.Region2D.#ctor
Constructor

IdeaRS.OpenModel.Geometry2D.Region2D.Outline
Gets or sets the outline curve of Region2D.

IdeaRS.OpenModel.Geometry2D.Region2D.Openings
Gets or sets the list of openings in the Region2D.